print("نکته : بین عدد و واحد اش فاصله نندازید ")
print(" مثله 8000" + ":" + "هشتهزار")
user_input = input("یک عدد وارد کنید: ")

QQZ= user_input.split()
def remove_and(cvbnm):
    updated_list = [item for item in cvbnm if item != "و"]
    return updated_list

mnmb = remove_and(QQZ)

n = " ".join(mnmb)


yekan = {
    "صفر": 0,
    "یک": 1,
    "دو": 2,
    "سه": 3,
    "چهار": 4,
    "پنج": 5,
    "شیش": 6,
    "هفت": 7,
    "هشت": 8,
    "نه": 9,
}
dahgan = {
    "" : 0,
    "ده" : 10,
    "بیست" : 20,
    "سی" : 30,
    "چهل" : 40,
    "پنجاه" : 50,
    "شست" : 60,
    "هفتاد" : 70,
    "هشتاد" : 80,
    "نود" : 90,
}
sadgan = {
    "": 0,
    "صد": 100,
    "دویست": 200,
    "سی صد": 300,
    " چهار صد": 400,
    "پانصد": 500,
    "شیش صد": 600,
    "هفصد": 700,
    "هشصد": 800,
    "نه صد": 900,
}
hezar = {
    "": 0,
    "هزار": 1000,
    "دوهزار": 2000,
    "سههزار": 3000,
    "چهارهزار": 4000,
    "پنجهزار": 5000,
    "شیشهزار": 6000,
    "هفتهزار": 7000,
    "هشتهزار": 8000,
    "نههزار": 9000,
}
daehzar = {
    "": 0,
    "دههزار": 10000,
    "بیستهزار": 20000,
    "سیهزار": 30000,
    "چهلهزار": 40000,
    "پنجاههزار": 50000,
    "شستهزار": 60000,
    "هفتادهزار": 70000,
    "هشتادهزار": 80000,
    "نودهزار": 90000,
}
sadhezar = {
    "": 0,
    "صدهزار": 100000,
    "دویستهزار": 200000,
    "سیصدهزار": 300000,
    "چهارصدهزار": 400000,
    "پانصدهزار": 500000,
    "شیشصدهزار": 600000,
    "هفصدهزار": 700000,
    "هشصدهزار": 800000,
    "نهصدهزار": 900000,
}
milyon = {
    "": 0,
    "میلیون": 1000000,
    "دومیلیون": 2000000,
    "سهمیلیون": 3000000,
    "چهارمیلیون": 4000000,
    "پنجمیلیون": 5000000,
    "شیشمیلیون": 6000000,
    "هفتمیلیون": 7000000,
    "هشتمیلیون": 8000000,
    "نهمیلیون": 9000000,
}
dah_milyon = {
    "": 0,
    "دهمیلیون": 10000000,
    "بیستمیلیون": 20000000,
    "سیمیلیون": 30000000,
    "چهلمیلیون": 40000000,
    "پنجاهمیلیون": 50000000,
    "شستمیلیون": 60000000,
    "هفتادمیلیون": 70000000,
    "هشتادمیلیون": 80000000,
    "نودمیلیون": 90000000,
}
sad_milyon ={
    "" : 0,
    "صدمیلیون" : 100000000,
    "دویستمیلیون" : 200000000,
    "سیصدمیلیون" : 300000000,
    "چهارصدمیلیون" : 400000000,
    "پانصدمیلیون" : 500000000,
    "شیشصدمیلیون" : 600000000,
    "هفصدمیلیون" : 700000000,
    "هشتصدمیلیون" : 800000000,
    "نهصدمیلیون" : 900000000,
}
milyard = {
    "": 0,
    "میلیارد": 1000000000,
    "د میلیارد": 2000000000,
    "سهمیلیارد": 3000000000,
    "چهارمیلیارد": 4000000000,
    "پنجمیلیارد": 5000000000,
    "شیشمیلیارد": 6000000000,
    "هفتمیلیارد": 7000000000,
    "هشتمیلیارد": 8000000000,
    "نهمیلیارد": 9000000000,
}

def convert_to_number(number_in_words):
    words = number_in_words.split()
    total_value = 0
    for index, word in enumerate(words):
        if word in yekan:
            total_value += yekan[word]
        elif word in dahgan:
            total_value += dahgan[word]
        elif word in sadgan:
            total_value += sadgan[word]
        elif word in sadhezar:
            total_value += sadhezar[word]
        elif word in daehzar:
            total_value += daehzar[word]
        elif word in hezar:
            total_value += hezar[word]
        elif word in milyon:
            total_value += milyon[word]
        elif word in dah_milyon:
            total_value += dah_milyon[word]
        elif word in sad_milyon:
            total_value += sad_milyon[word]
        elif word in milyard:
            total_value += milyard[word]
    return total_value



k = convert_to_number(n)

print(k)
